! Задание:
! 1. Написать программу, которая:
!    a) вводит из файла In.txt на диске количество строк и
!       столбцов матрицы, вводит матрицу в динамический массив;
!    b) выводит по формату матрицу A с заголовком в файл
!       Out.txt;
!    c) вводит с клавиатуры дополнительные параметры, если они
!       есть в варианте индивидуального задания;
!    d) выполняет первую часть индивидуального задания,
!       используя вложенные циклы (встроенными функциями для
!       массивов не пользоваться);
!    e) выполняет вторую часть индивидульного задания с
!       использованием встроенных функций для массивов;
!    f) выводит по формату результаты работы программы, поясняя
!       смысл каждого значения формулировками из индивидуального
!       задания.
! 2. Дополнить программу внешним циклом, в котором
!    последовательно ввести матрицы разных размеров, и выполнить
!    для каждой из них индивидуальное задание.
!
! Комментарии к заданию:
! 1. Встроенные функции для массивов смотрите в разделе 6.2.
! 2. Формулы для вычисления средних значений -- в разделе 7.4.
! 3. Каждую матрицу готовить в файле In.txt следующим образом:
!    a) M, N, (M и N -- количество строк и столбцов матрицы);
!    b) матрица, содержащая M строк и N столбцов.
!    Далее пункты a) и b) повторяются для каждой следующей
!    матрицы.
! 4. Рекомендуется выбрать M<=10 и N<=10 и для контроля вывести
!    M и N в файл результатов Out.txt
!
! Индивидульаное задание (вариант 6):
!    По умолчанию все массивы вещественные и обе части задания
!    выполняются для одной и той же матрицы.