Program lab
! -----------------------------------------------------------------------
! Структура файла In.txt:
!   Количество строк (<=10)
!   Количество столбцов (<=10)
!   Матрица (указанных выше размеров, содержит вещественные значения)
! -----------------------------------------------------------------------
! Пример файла Out.txt -- стр. 53
! -----------------------------------------------------------------------


! Ввод из файла In.txt:
!   количества строк
!   количества столбцов

! Создание динамического массива указанного размера

! Заполнение созданного динамического массива значениями матрицы из
! файла In.txt

! Вывод по формату матрицы с заголовком в файл Out.txt 

! -----------------------------------------------------------------------
! Далее должны использоваться вложенные циклы (встроенными
! функциями для массивов пользоваться запрещается).
! -----------------------------------------------------------------------

! Составить одномерный массив из максимальных отрицательных элементов
! каждой строки матрицы. (Для строк не содержащих отрицательных
! элементов в результирующий массив записать 0).

! Вывод полученного массива.

! -----------------------------------------------------------------------
! Далее должны использоваться встроенные функции для массивов.
! -----------------------------------------------------------------------

! Составить одномерный массив из средних квадратичных значений элементов
! с четными номерами строк в каждом столбце матрицы.

! Вывод полученного массива.

! Внешний цикл, в котором производится последовательный ввод матриц разных
! размеров, и для каждой из них выполняется индивидуальное задание.


End Program lab